1.0/diagrams/Consequences.dot
#
# impact

digraph G {
   //rankdir=LR;
node [shape=rect,style=filled,fillcolor=yellow];



Impact -> Benefit [dir=both, arrowhead=none, arrowtail=onormal] ;
Impact -> 	Damage [dir=both, arrowhead=none, arrowtail=onormal] ;
Impact -> 	Detriment [dir=both, arrowhead=none, arrowtail=onormal] ;
Damage -> Harm [dir=both, arrowhead=none, arrowtail=onormal] ;
Damage -> MaterialDamage [dir=both, arrowhead=none, arrowtail=onormal] ;
Damage -> NonMaterialDamage [dir=both, arrowhead=none, arrowtail=onormal] ;

Consequence -> ConsequenceAsSideEffect [dir=both, arrowhead=none, arrowtail=onormal] ;
Consequence -> ConsequenceOfFailure [dir=both, arrowhead=none, arrowtail=onormal] ;
Consequence -> ConsequenceOfSuccess [dir=both, arrowhead=none, arrowtail=onormal] ;
Consequence -> Impact [dir=both, arrowhead=none, arrowtail=onormal] ;

}
